# Вариант 9
# 1. Дано целое число N (>0). Найти сумму 1 + 1/2 + 1/3 + ... + 1/N

N = int(input("Введите целое число N (> 0): "))
sum = 0.0
for i in range(1, N + 1):
    sum = sum + 1/i
print("Сумма равна", sum)




