# Создайте класс "Калькулятор" с методами "сложение", "вычитание", "умножение" и
# "деление". Каждый метод должен принимать два аргумента и возвращать результат
# операции

from colorama import init, Fore, Back, Style

print(Style.BRIGHT + Fore.GREEN)
print("+──────────────────────────────────────────────────────── +\n| ╔╗╔══╗╔══╗ ╔══╗╔╗   ╔╗╔══╗╔╗╔╗ ╔══╗╔═══╗╔════╗╔══╗╔═══╗ |\n| ║║║╔═╝║╔╗║ ║╔╗║║║   ║║║╔═╝║║║║ ║╔╗║║╔═╗║╚═╗╔═╝║╔╗║║╔═╗║ |\n| ║╚╝║  ║╚╝║ ║║║║║╚══╗║╚╝║  ║╚╝║ ║║║║║╚═╝║  ║║  ║║║║║╚═╝║ |\n| ║╔╗║  ║╔╗║ ║║║║║╔═╗║║╔╗║  ╚═╗║ ║║║║╚╗╔╗║  ║║  ║║║║║╔══╝ |\n| ║║║╚═╗║║║║╔╝║║║║╚═╝║║║║╚═╗ ╔╝║╔╝║║║ ║║║║  ║║  ║╚╝║║║    |\n| ╚╝╚══╝╚╝╚╝╚═╝╚╝╚═══╝╚╝╚══╝ ╚═╝╚═╝╚╝ ╚╝╚╝  ╚╝  ╚══╝╚╝    | \n+──────────────────────────────────────────────────────── +")

print(Style.BRIGHT + Fore.YELLOW)
print(' '*7 ,"-" * 42)
print(' '*7 ,'| Выберите действие:' , " " * 19 , "|")
print(' '*7 ,"-" * 42)
print(' '*7 ,'| 1. Сложение' , " " * 26 , "|")
print(' '*7 ,"-" * 42)
print(' '*7 ,'| 2. Вычитание' , " " * 25 , "|")
print(' '*7 ,"-" * 42)
print(' '*7 ,'| 3. Умножение'  , " " * 25 , "|")
print(' '*7 ,"-" * 42)
print(' '*7 ,'| 4. Деление'  , " " * 27 , "|")
print(' '*7 ,"-" * 42)
print(' '*7 ,'| 5. Возведение'  , " " * 24, "|")
print(' '*7 ,"-" * 42)

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

math = int(input("        -> "))

a = int(input("        A -> "))
b = int(input("        B -> "))


class Calculator:
    def add(self, a, b):
        return(a + b)
    
    def sub(self, a, b):
        return(a - b)
   
    def mlp(self, a, b):
        return(a * b)
    
    def dvd(self, a, b):
        if b == 0:
            raise ValueError("На ноль делить нельзя, УЧИ МАТЕМАТИКУ !!!")        
        else:
            return(a / b)
    
    def sqr(self, a, b):
        return(a ** b)
    
calc = Calculator()


if math == 1:
    result = calc.add(a,b)
elif math == 2:
    result = calc.sub(a,b)
elif math == 3:
    result = calc.mlp(a,b)
elif math == 4:
    result = calc.dvd(a,b)
elif math == 5:
    result = calc.sqr(a,b)

print(Style.BRIGHT + Fore.WHITE)
print("        Результат -> ", result)
print("  ")

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------